---
kind: type
id: T:Autodesk.Revit.DB.BoxPlacement
source: html/2ecf1f45-4890-8b9f-3de7-8d0eebeb7ce7.htm
---
# Autodesk.Revit.DB.BoxPlacement

An enumerated type containing possible constraint types for Adaptive Points.

## Syntax (C#)
```csharp
public enum BoxPlacement
```